"use client";  // 클라이언트 컴포넌트로 명시

import React, { useState } from 'react';
import axios from 'axios';

export default function SignUpPage() {
  const [email, setEmail] = useState('');
  const [nickname, setNickname] = useState('');
  const [password, setPassword] = useState('');
  const [termsAccepted, setTermsAccepted] = useState(false);

  const handleEmailCheck = async () => {
    if (!email) {
      alert('이메일을 입력해주세요.');
      return;
    }
  
    try {
      const response = await axios.post('https://port-0-nodejs-wordwiseweb-be-m0c7usj0d8d98e17.sel4.cloudtype.app/api/user/register/check-email', { email });
      if (response.data.success) {
        alert('사용 가능한 이메일입니다.');
      } else {
        alert(response.data.message || '이미 가입된 이메일입니다.'); // 서버 메시지 또는 기본 메시지 사용
      }
    } catch (error) {
      if (error.response && error.response.data && error.response.data.message) {
        alert(error.response.data.message); // 서버에서 반환된 메시지 표시
      } else {
        alert('이메일 확인 중 오류가 발생했습니다.');
      }
    }
  };
  

  const handleNicknameCheck = async () => {
    if (!nickname) {
      alert('닉네임을 입력해주세요.');
      return;
    }

    try {
      const response = await axios.post('https://port-0-nodejs-wordwiseweb-be-m0c7usj0d8d98e17.sel4.cloudtype.app/api/user/register/check-nickname', { nickname });
      if (response.data.success) {
        alert('사용 가능한 닉네임입니다.');
      } else {
        alert(response.data.message || '이미 가입된 닉네임입니다.'); // "이미 가입된 닉네임입니다."
      }
    } catch (error) {
      if (error.response && error.response.data && error.response.data.message) {
        alert(error.response.data.message); // 서버에서 반환된 메시지 표시
      } else {
        alert('닉네임 확인 중 오류가 발생했습니다.');
      }
    }
  };

  const handleSignUp = async () => {
    if (!termsAccepted) {
      alert('약관에 동의해야 합니다.');
      return;
    }

    try {
      const response = await axios.post('https://port-0-nodejs-wordwiseweb-be-m0c7usj0d8d98e17.sel4.cloudtype.app/api/user/register', { email, password, nickname });
      if (response.data.success) {
        alert('회원가입이 완료되었습니다.');
        // 로그인 페이지로 리다이렉션
        window.location.href = 'http://localhost:3000/login';
      } else {
        alert(response.data.message); // "회원가입에 실패했습니다."
      }
    } catch (error) {
      if (error.response && error.response.data && error.response.data.message) {
        alert(error.response.data.message); // 서버에서 반환된 메시지 표시
      } else {
        alert('닉네임 확인 중 오류가 발생했습니다.');
      }
    }
  };

  return (
    <div className="w-[1920px] h-[1080px] relative bg-white">
      {/* SVG 전체 코드 삽입 */}
      <svg
        width={257}
        height={143}
        viewBox="0 0 257 143"
        fill="none"
        xmlns="http://www.w3.org/2000/svg"
        className="w-[257px] h-[143px] absolute left-[832px] top-[120px]"
        preserveAspectRatio="none"
      >
        <path
          fillRule="evenodd"
          clipRule="evenodd"
          d="M175.775 51.5C175.775 77.6095 154.609 98.7754 128.5 98.7754C102.391 98.7754 81.2246 77.6095 81.2246 51.5C81.2246 25.3905 102.391 4.22461 128.5 4.22461C154.609 4.22461 175.775 25.3905 175.775 51.5ZM131.779 36.0917H138.626L128.511 67.0122H120.825L114.022 46.0746L106.999 67.0122H99.357L89.1974 36.0917H96.6183L103.597 57.8244L110.886 36.0917H117.512L124.579 58.0011L131.779 36.0917ZM167.892 35.9892H145.496L143.567 41.8793H167.892V35.9892ZM141.387 48.5548H167.892V54.4449H139.495L141.387 48.5548ZM167.892 61.1204H137.352L135.423 67.0105H167.892V61.1204Z"
          fill="#336690"
        />
        <path
          d="M238.298 118.336H248.065C249.782 118.336 251.239 118.594 252.435 119.109C253.641 119.613 254.549 120.33 255.158 121.259C255.766 122.178 256.071 123.259 256.071 124.502C256.071 125.409 255.886 126.227 255.516 126.955C255.147 127.683 254.63 128.288 253.967 128.769C253.315 129.251 252.554 129.581 251.685 129.761V129.996C252.641 130.041 253.527 130.31 254.342 130.802C255.158 131.295 255.804 131.978 256.283 132.852C256.761 133.726 257 134.734 257 135.876C257 137.187 256.674 138.352 256.022 139.371C255.38 140.39 254.44 141.197 253.201 141.79C251.973 142.373 250.505 142.664 248.799 142.664H238.298V118.336ZM247.478 138.027C248.315 138.027 249.005 137.915 249.549 137.691C250.103 137.456 250.511 137.131 250.772 136.716C251.043 136.302 251.179 135.803 251.179 135.221C251.179 134.594 251.032 134.045 250.739 133.575C250.456 133.093 250.043 132.729 249.5 132.482C248.967 132.225 248.331 132.096 247.592 132.096H243.842V138.027H247.478ZM247.119 128.383C247.761 128.383 248.331 128.271 248.831 128.047C249.331 127.812 249.717 127.487 249.989 127.072C250.272 126.658 250.413 126.16 250.413 125.577C250.413 125.028 250.282 124.552 250.022 124.149C249.772 123.746 249.407 123.438 248.929 123.225C248.451 123.012 247.88 122.906 247.217 122.906H243.842V128.383H247.119Z"
          fill="#336690"
        />
        <path
          d="M220.076 118.336H236.43V123.007H225.62V128.165H235.582V132.818H225.62V137.993H236.43V142.664H220.076V118.336Z"
          fill="#336690"
        />
        <path
          d="M186.201 118.336H192.315L195.951 134.448H196.163L200.256 118.336H205.327L209.436 134.499H209.631L213.284 118.336H219.398L212.566 142.664H207.169L202.881 127.677H202.718L198.413 142.664H193.049L186.201 118.336Z"
          fill="#336690"
        />
        <path
          d="M163.387 118.336H179.741V123.007H168.931V128.165H178.893V132.818H168.931V137.993H179.741V142.664H163.387V118.336Z"
          fill="#336690"
        />
        <path
          d="M156.53 125.56C156.475 124.967 156.301 124.457 156.008 124.032C155.714 123.606 155.301 123.287 154.769 123.074C154.236 122.85 153.589 122.738 152.828 122.738C152.1 122.738 151.48 122.839 150.97 123.04C150.459 123.242 150.073 123.522 149.812 123.88C149.551 124.239 149.421 124.653 149.421 125.124C149.399 125.829 149.687 126.395 150.285 126.821C150.883 127.235 151.763 127.582 152.926 127.862L154.981 128.333C157.35 128.87 159.138 129.738 160.345 130.937C161.551 132.124 162.166 133.681 162.187 135.608C162.187 137.131 161.812 138.447 161.062 139.556C160.312 140.653 159.242 141.499 157.85 142.093C156.459 142.675 154.79 142.966 152.845 142.966C150.855 142.966 149.133 142.658 147.676 142.042C146.219 141.426 145.094 140.502 144.301 139.27C143.507 138.027 143.089 136.487 143.045 134.65H148.393C148.448 135.423 148.66 136.078 149.029 136.616C149.399 137.142 149.904 137.54 150.546 137.808C151.187 138.077 151.926 138.212 152.763 138.212C153.546 138.212 154.22 138.1 154.785 137.876C155.35 137.652 155.779 137.344 156.073 136.952C156.377 136.56 156.53 136.106 156.53 135.591C156.53 135.131 156.394 134.734 156.122 134.398C155.85 134.062 155.437 133.771 154.883 133.524C154.328 133.278 153.6 133.048 152.698 132.835L150.22 132.231C148.1 131.738 146.48 130.942 145.361 129.845C144.241 128.747 143.681 127.302 143.681 125.51C143.681 124.032 144.073 122.727 144.855 121.595C145.638 120.464 146.725 119.585 148.116 118.958C149.508 118.319 151.089 118 152.861 118C154.654 118 156.225 118.314 157.573 118.941C158.932 119.568 159.981 120.453 160.72 121.595C161.47 122.738 161.85 124.06 161.861 125.56H156.53Z"
          fill="#336690"
        />
        <path d="M141.845 142.664H136.302V118.336H141.845V142.664Z" fill="#336690" />
        <path
          d="M102.427 118.336H108.541L112.177 134.448H112.389L116.482 118.336H121.552L125.661 134.499H125.857L129.509 118.336H135.623L128.792 142.664H123.395L119.107 127.677H118.944L114.639 142.664H109.275L102.427 118.336Z"
          fill="#336690"
        />
        <path
          d="M78.2924 142.664V137.775H84.3578C85.76 137.775 86.9177 137.528 87.8307 137.036C88.7547 136.543 89.4504 135.759 89.9178 134.683C90.396 133.608 90.6352 132.214 90.6352 130.5C90.6352 128.764 90.396 127.358 89.9178 126.283C89.4504 125.208 88.7493 124.429 87.8144 123.947C86.8905 123.466 85.722 123.225 84.3089 123.225H78.1946V118.336H84.5698C86.972 118.336 89.0427 118.823 90.7819 119.798C92.532 120.772 93.8744 122.172 94.8092 123.998C95.744 125.824 96.2114 127.991 96.2114 130.5C96.2114 133.009 95.744 135.176 94.8092 137.002C93.8744 138.828 92.532 140.228 90.7819 141.202C89.0319 142.177 86.9612 142.664 84.5698 142.664H78.2924ZM81.4719 142.664H75.9282V118.336H81.4719V142.664Z"
          fill="#336690"
        />
        <path
          d="M56.2388 118.336H65.8912C67.663 118.336 69.1902 118.666 70.4729 119.327C71.7664 119.977 72.7556 120.912 73.4404 122.133C74.136 123.343 74.4839 124.771 74.4839 126.417C74.4839 128.053 74.1306 129.464 73.4241 130.651C72.7284 131.838 71.7175 132.74 70.3914 133.356C69.0761 133.972 67.5217 134.28 65.7282 134.28H59.5323V129.727H64.7336C65.6249 129.727 66.3586 129.609 66.9347 129.374C67.5217 129.128 67.9674 128.764 68.2717 128.282C68.5761 127.789 68.7283 127.168 68.7283 126.417C68.7283 125.644 68.5761 125.006 68.2717 124.502C67.9674 123.998 67.5163 123.617 66.9184 123.359C66.3315 123.102 65.5977 122.973 64.7173 122.973H61.7824V142.664H56.2388V118.336ZM75.2991 142.664H69.1848L63.4618 131.558H69.4131L75.2991 142.664Z"
          fill="#336690"
        />
        <path
          d="M54.6309 130.5C54.6309 133.099 54.1418 135.339 53.1635 137.22C52.1852 139.102 50.8482 140.536 49.1525 141.522C47.4568 142.507 45.5383 143 43.3969 143C41.2664 143 39.3479 142.507 37.6413 141.522C35.9456 140.536 34.6086 139.097 33.6303 137.204C32.6629 135.311 32.1792 133.076 32.1792 130.5C32.1792 127.879 32.6629 125.628 33.6303 123.746C34.6086 121.864 35.9456 120.436 37.6413 119.462C39.3479 118.487 41.2664 118 43.3969 118C45.5383 118 47.4568 118.487 49.1525 119.462C50.8482 120.436 52.1852 121.864 53.1635 123.746C54.1418 125.628 54.6309 127.879 54.6309 130.5ZM48.9569 130.5C48.9569 128.898 48.734 127.543 48.2884 126.434C47.8536 125.314 47.2177 124.468 46.3807 123.897C45.5546 123.315 44.56 123.024 43.3969 123.024C42.2447 123.024 41.2501 123.315 40.4131 123.897C39.587 124.468 38.9511 125.314 38.5055 126.434C38.0707 127.543 37.8533 128.898 37.8533 130.5C37.8533 132.102 38.0707 133.463 38.5055 134.583C38.9511 135.692 39.587 136.537 40.4131 137.12C41.2501 137.691 42.2447 137.976 43.3969 137.976C44.56 137.976 45.5546 137.691 46.3807 137.12C47.2177 136.537 47.8536 135.692 48.2884 134.583C48.734 133.463 48.9569 132.102 48.9569 130.5Z"
          fill="#336690"
        />
        <path
          d="M0 118.336H6.11431L9.75029 134.448H9.96225L14.0548 118.336H19.1256L23.2344 134.499H23.43L27.0823 118.336H33.1966L26.3649 142.664H20.968L16.6798 127.677H16.5168L12.2123 142.664H6.84803L0 118.336Z"
          fill="#336690"
        />
      </svg>

      {/* 이메일 입력 */}
      <div className="flex flex-col justify-start items-start absolute left-[773px] top-[313px] gap-5">
        <div className="flex justify-start items-start self-stretch flex-grow-0 flex-shrink-0">
          <div className="flex justify-between items-center flex-grow-0 flex-shrink-0 w-[377px] h-[54px] relative px-6 py-[13px] rounded-[20px] bg-gray-100">
            <input
              type="email"
              value={email}
              onChange={(e) => setEmail(e.target.value)}
              placeholder="이메일"
              className="w-full text-lg text-[#383838] bg-transparent"
            />
            <button onClick={handleEmailCheck} className="ml-3 text-sm text-blue-500">
              이메일 중복 확인
            </button>
          </div>
        </div>

        {/* 닉네임 입력 */}
        <div className="flex justify-start items-center self-stretch flex-grow-0 flex-shrink-0 relative gap-2.5 px-6 py-[13px] rounded-[20px] bg-gray-100">
          <input
            type="text"
            value={nickname}
            onChange={(e) => setNickname(e.target.value)}
            placeholder="닉네임"
            className="w-full text-lg text-[#383838] bg-transparent"
          />
          <button onClick={handleNicknameCheck} className="ml-3 text-sm text-blue-500">
            닉네임 중복 확인
          </button>
        </div>

        {/* 비밀번호 입력 */}
        <div className="self-stretch flex-grow-0 flex-shrink-0 h-[54px] relative rounded-[20px] bg-gray-100">
          <div className="w-[329px] h-7 absolute left-6 top-[13px]">
            <input
              type="password"
              value={password}
              onChange={(e) => setPassword(e.target.value)}
              placeholder="비밀번호"
              className="w-full text-lg text-[#383838] bg-transparent"
            />
          </div>
        </div>

        {/* 약관 동의 체크박스 */}
        <div className="flex items-center gap-2">
          <input
            type="checkbox"
            id="terms"
            checked={termsAccepted}
            onChange={() => setTermsAccepted(!termsAccepted)}
            className="w-5 h-5"
          />
          <label htmlFor="terms" className="text-base text-left text-[#383838]">
            개인정보처리방침 | 이용약관 전체 동의
          </label>
        </div>

        {/* 회원가입 버튼 */}
        <div className="flex flex-col justify-start items-start self-stretch flex-grow-0 flex-shrink-0 gap-[15px]">
          <button
            onClick={handleSignUp}
            className="flex justify-center items-center flex-grow-0 flex-shrink-0 relative px-40 py-[15px] rounded-lg bg-[#336690] border-2 border-[#333236] text-white font-bold"
          >
            회원가입
          </button>
        </div>
      </div>
    </div>
  );
}
